In [1]:
# zmienne
a=2
b = 3
suma = a+b
print(suma)

5

In [2]:
s = 'jan kowalski'

In [3]:
print(s)

jan kowalski

In [4]:
print(s[2])

n

In [5]:
lst = list(range(10))
lst

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [6]:
lst.append('bocian')
print(lst)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 'bocian']

In [7]:
import pandas as pd

In [11]:
df=pd.DataFrame({'lp':lst, 'nazwa':aa})

In [10]:
aa = ['janek', 'malgosia', 'jurek', 'stasio', 'hania', 'renia', 'kazio', 'Łucja', 'jasia','zaba','iza']
len(aa)

11

In [12]:
df

        lp     nazwa
0        0     janek
1        1  malgosia
2        2     jurek
3        3    stasio
4        4     hania
5        5     renia
6        6     kazio
7        7     Łucja
8        8     jasia
9        9      zaba
10  bocian       iza

In [16]:
df[df['lp']=='bocian']

        lp nazwa
10  bocian   iza

In [17]:
dd = pd.read_clipboard()

In [18]:
dd

                 Nazwisko  wynagrodzenie  stanowisko      dzial
0       Bochenek Elżbieta        2295.66    szwaczka  produkcja
1     Czarnecka Mirosława        1906.05    szwaczka  produkcja
2            Gozdan Hanna        2295.66  sekretarka      biuro
3    Grzeszkiewicz Bożena        2602.25  sprzedawca      biuro
4    Jędrzejewska Grażyna        2240.78    szwaczka  produkcja
5      Kaźmierczak Dorota         735.70    szwaczka  produkcja
6     Kłosińska Agnieszka        2446.23     krojcza  produkcja
7             Malik Iwona        2446.23     krojcza  produkcja
8       Małkiewicz Helena        1427.90    krawcowa  produkcja
9      Matuszewska Monika        1660.03    krawcowa  produkcja
10     Nowosielska Teresa        2528.30    krawcowa  produkcja
11  Nowosielski Tymoteusz        1768.79    mechanik   warsztat
12         Olewnik Danuta         941.24    krawcowa  produkcja
13          Ostrowska Ewa        2086.78    szwaczka  produkcja
14       Puławska Cecylia        2261.32    szwaczka  produkcja
15       Rojek Małgorzata        3203.21    krawcowa  produkcja
16         Romańska Hanna        2295.66     krojcza  produkcja
17     Rzeczkowska Teresa        2446.23    szwaczka  produkcja
18         Rzemek Jadwiga        1584.58    krawcowa  produkcja
19          Siczek Danuta        2824.36    krawcowa  produkcja
20      Świadkowska Beata        2496.26     krojcza  produkcja
21      Świadkowski Artur        2399.92    mechanik   warsztat
22         Tomporek Beata        5371.00    szwaczka  produkcja
23     Zalewska Agnieszka        5855.70  sprzedawca      biuro
24      Lucyna Nowakowska        5600.00  sprzedawca   promocja
25   Maciejewski Zbigniew        5600.00    mechanik   warsztat

In [21]:
dd.groupby(dd['stanowisko']).sum().sort_values(by = 'wynagrodzenie')

            wynagrodzenie
stanowisko
sekretarka        2295.66
krojcza           9684.38
mechanik          9768.71
sprzedawca       14057.95
krawcowa         14169.62
szwaczka         19343.52